<?php

use Illuminate\Database\Migrations\Migration;
use Illuminate\Database\Schema\Blueprint;
use Illuminate\Support\Facades\Schema;

class CreateSeedlingsTable extends Migration
{
    /**
     * Run the migrations.
     *
     * @return void
     */
    public function up()
    {
        Schema::create('seedlings', function (Blueprint $table) {
            $table->bigIncrements('id');
            $table->string('title');
            $table->string('beginning_fruiting')->default('');
            $table->string('fruit_bearing')->default('');
            $table->string('fruiting')->default('от 100 и выше');
            $table->string('season')->default('');
            $table->decimal('fruit_price', 8, 2)->default(0);
            $table->integer('fruit_measure_id')->default(1);
            $table->string('number_of_varieties');
            $table->string('image')->nullable();
            $table->decimal('price_3', 8, 2);
            $table->decimal('price_4', 8, 2);
            $table->decimal('price_5', 8, 2);
            $table->decimal('price_6', 8, 2);
            $table->decimal('price_7', 8, 2);
            $table->decimal('price_8', 8, 2);
            $table->decimal('price_9', 8, 2);
            $table->timestamps();
        });
    }

    /**
     * Reverse the migrations.
     *
     * @return void
     */
    public function down()
    {
        Schema::dropIfExists('seedlings');
    }
}


/*

INSERT INTO `seedlings` (`id`, `title`, `beginning_fruiting`, `fruit_bearing`, `fruiting`, `season`, `fruit_price`, `fruit_measure_id`, `number_of_varieties`, `price_3`, `price_4`, `price_5`, `price_6`, `price_7`, `price_8`, `price_9`, `created_at`, `updated_at`) VALUES
(1, 'Айва', '3-7', 'от 15', 'от 100 и выше', 'сентябрь-октябрь', '100.00', 1, '2', '2500.00', '3500.00', '5000.00', '6500.00', '9000.00', '12000.00', '15000.00', NULL, NULL),
(2, 'Авокадо', '4-6', '8-10', 'от 100 и выше', 'август', '100.00', 1, '1', '5000.00', '7000.00', '10000.00', '15000.00', '25000.00', '30000.00', '35000.00', NULL, NULL),
(3, 'Азимина', '3-5', '7-9', 'от 100 и выше', 'сентябрь-октябрь', '200.00', 1, '2', '3000.00', '6500.00', '1200.00', '15000.00', '20000.00', '30000.00', '40000.00', NULL, NULL),
(4, 'Алыча', '2-3', '4-5', 'от 100 и выше', 'июнь-июль', '50.00', 1, '3', '3500.00', '5000.00', '10000.00', '17000.00', '22000.00', '30000.00', '37000.00', NULL, NULL),
(5, 'Апельсин', '2-5', '7', 'от 100 и выше', 'ноябрь-январь', '150.00', 1, '1', '1800.00', '3000.00', '5000.00', '6500.00', '8000.00', '9000.00', '10000.00', NULL, NULL),
(6, 'Вишня', '2-3', '5', 'от 100 и выше', 'июнь-август', '150.00', 1, '2', '2000.00', '3500.00', '5500.00', '7000.00', '8500.00', '11000.00', '13000.00', NULL, NULL),
(7, 'Виноград', '2-3', '7', 'от 100 и выше', 'сентябрь', '100.00', 1, '7', '2500.00', '3500.00', '4000.00', '5500.00', '6200.00', '7000.00', '8500.00', NULL, NULL),
(8, 'Груша', '3', '8', 'от 100 и выше', 'зависит от сорта', '100.00', 1, '4', '3000.00', '5000.00', '7000.00', '10000.00', '15000.00', '16000.00', '17000.00', NULL, NULL),
(9, 'Грейпфрут', '2', '5', 'от 100 и выше', 'декабрь-январь', '150.00', 1, '1', '3500.00', '6000.00', '9000.00', '14000.00', '17000.00', '20000.00', '25000.00', NULL, NULL),
(10, 'Гранат', '2', '5', 'от 100 и выше', 'октябрь-ноябрь', '200.00', 1, '3', '2000.00', '5000.00', '7000.00', '9000.00', '10000.00', '15000.00', '17000.00', NULL, NULL),
(11, 'Инжир', '1', '4', 'от 100 и выше', 'август-сентябрь', '200.00', 1, '4', '1500.00', '4000.00', '6500.00', '10000.00', '15000.00', '21000.00', '25000.00', NULL, NULL),
(12, 'Кин-кан', '1', '3', 'от 100 и выше', 'декабрь', '350.00', 1, '1', '3500.00', '6000.00', '10000.00', '14000.00', '20000.00', '25000.00', '35000.00', NULL, NULL),
(13, 'Кизил', '3', '5-7', 'от 100 и выше', 'август', '150.00', 1, '1', '2500.00', '5000.00', '11000.00', '14000.00', '16000.00', '18000.00', '20000.00', NULL, NULL),
(14, 'Лимон', '1', '4', 'от 100 и выше', 'круглый год', '200.00', 1, '2', '5500.00', '6500.00', '15000.00', '17000.00', '20000.00', '25000.00', '30000.00', NULL, NULL),
(15, 'Лох(барбарис)', '3-4', '5-7', 'от 100 и выше', 'октябрь', '350.00', 1, '2', '1500.00', '2500.00', '4000.00', '6000.00', '8000.00', '12000.00', '17000.00', NULL, NULL),
(16, 'Лавровишня', '4', '7-9', 'от 100 и выше', 'сент', '150.00', 1, '1', '1500.00', '2500.00', '5000.00', '7000.00', '13000.00', '16000.00', '12000.00', NULL, NULL),
(17, 'Мандарин', '1-3', '5', 'от 100 и выше', 'сентябрь-октябрь', '100.00', 1, '3', '5000.00', '6000.00', '10000.00', '14000.00', '18000.00', '23000.00', '27000.00', NULL, NULL),
(18, 'Мушмула японская', '4', '7', 'от 100 и выше', 'август', '100.00', 1, '1', '2000.00', '4500.00', '7000.00', '10000.00', '13000.00', '17000.00', '20000.00', NULL, NULL),
(19, 'Мушмула германская', '3', '7', 'от 100 и выше', 'ноябрь', '100.00', 1, '1', '3000.00', '6000.00', '12000.00', '16000.00', '20000.00', '24000.00', '28000.00', NULL, NULL),
(20, 'Маслина', '4', '8', 'от 100 и выше', 'октябрь', '400.00', 1, '1', '2500.00', '8000.00', '12000.00', '17000.00', '21000.00', '25000.00', '30000.00', NULL, NULL),
(21, 'Орех грецкий', '4-5', '10', 'от 100 и выше', 'сентябрь', '200.00', 1, '2', '2000.00', '4000.00', '5000.00', '8000.00', '14000.00', '170000.00', '22000.00', NULL, NULL),
(22, 'Орех пекан', '5', '13', 'от 100 и выше', 'октябрь', '400.00', 1, '1', '1500.00', '3500.00', '5000.00', '8000.00', '10000.00', '15000.00', '22000.00', NULL, NULL),
(23, 'Орех фундук', '5', '10', 'от 100 и выше', 'август', '150.00', 1, '3', '1500.00', '3000.00', '4000.00', '5000.00', '7500.00', '10000.00', '15000.00', NULL, NULL),
(24, 'Персик', '1', '2-3', 'от 100 и выше', 'июнь-август', '150.00', 1, '4', '2500.00', '4000.00', '6000.00', '7500.00', '10000.00', '12500.00', '16000.00', NULL, NULL),
(25, 'Пшат', '', '', 'от 100 и выше', '', '200.00', 1, '1', '3000.00', '4500.00', '7000.00', '9000.00', '12000.00', '15000.00', '25000.00', NULL, NULL),
(26, 'Псилиум', '', '', 'от 100 и выше', '', '0.00', 1, '1', '3500.00', '5500.00', '10000.00', '12500.00', '15000.00', '17000.00', '22000.00', NULL, NULL),
(27, 'Слива', '2', '5-7', 'от 100 и выше', 'август', '150.00', 1, '7', '1500.00', '3000.00', '5500.00', '7000.00', '9000.00', '10500.00', '12000.00', NULL, NULL),
(28, 'Унаби', '4', '7-9', 'от 100 и выше', 'октябрь', '250.00', 1, '2', '5000.00', '5500.00', '8000.00', '10500.00', '15000.00', '21000.00', '25000.00', NULL, NULL),
(29, 'Фейхоа', '2-3', '5-7', 'от 100 и выше', 'октябрь-ноябрь', '150.00', 1, '2', '1200.00', '3000.00', '5000.00', '7500.00', '10000.00', '15000.00', '20000.00', NULL, NULL),
(30, 'Черешня', '2', '7-8', 'от 100 и выше', 'июнь-июль', '150.00', 1, '4', '2500.00', '5000.00', '7500.00', '9200.00', '11000.00', '13500.00', '17800.00', NULL, NULL),
(31, 'Шелковица', '2', '7-8', 'от 100 и выше', 'август', '300.00', 1, '2', '2500.00', '4000.00', '6000.00', '8500.00', '10000.00', '13000.00', '18000.00', NULL, NULL),
(32, 'Яблоня', '2', '4-7', 'от 100 и выше', 'от сорта', '100.00', 1, '8', '1500.00', '3000.00', '5000.00', '7000.00', '9000.00', '10500.00', '15000.00', NULL, NULL),
(33, 'хурма', '2', '4-8', 'от 100 и выше', 'октябрь', '100.00', 1, '3', '2000.00', '4000.00', '7000.00', '8500.00', '10000.00', '15000.00', '18000.00', NULL, NULL);


*/